turgu1/esp32-scheme-vm/src/builtins-control.c
// builtins-control
// Builtin Indexes: 1..5

#include "esp32-scheme-vm.h"
#include "vm-arch.h"
#include "mm.h"

#include "interpreter.h"
#include "builtins.h"

BUILTIN(return, return, 1, 1)
{
  EXPECT(RAM_IS_CONTINUATION(cont), "return", "continuation");

	reg2  = RAM_GET_CONT_CLOSURE(cont);

  EXPECT(RAM_IS_CLOSURE(reg2), "return.1", "closure");

	entry = RAM_GET_CLOSURE_ENTRY_POINT(reg2);
	env   = RAM_GET_CLOSURE_ENV(reg2);
	cont  = RAM_GET_CONT_PARENT(cont);
	reg2  = NIL;
  pc    = program + entry;
}

BUILTIN_UNSPEC(pop, pop, 0, 2)
{
	pop();
}

BUILTIN(get-cont, get_cont, 0, 3)
{
  EXPECT(RAM_IS_CONTINUATION(cont), "get-cont", "continuation");

	reg1 = cont;
}

BUILTIN_UNSPEC(graft-to-cont, graft_to_cont, 2, 4)
{
	/* reg2 is thunk to call, reg1 is continuation */
	cont = reg1;

  EXPECT(RAM_IS_CONTINUATION(cont), "graft-to-cont", "continuation");

	reg1 = reg2;
  env = new_pair(reg1, env);

	build_environment(prepare_arguments(0));

	env = reg1;
	pc = program + entry;

	reg1 = NIL;
	reg2 = NIL;
}

BUILTIN(return-to-cont, return_to_cont, 2, 5)
{
	/* reg2 is value to return, reg1 is continuation */
	cont = reg1;

  EXPECT(RAM_IS_CONTINUATION(cont), "return-to-cont", "continuation");

	reg1 = reg2;

	reg2  = RAM_GET_CONT_CLOSURE(cont);
	entry = RAM_GET_CLOSURE_ENTRY_POINT(reg2);
	env   = RAM_GET_CLOSURE_ENV(reg2);
	cont  = RAM_GET_CONT_PARENT(cont);

	reg2 = NIL;
}


#if TESTING
void builtins_control_tests()
{

}
#endif
